export const pythonCourse = {
    title: '파이썬 숲에서 살아남기',
    topics: [
        'Python 1주차 - 변수, 자료형, 연산자',
        'Python 2주차 - 입출력, 자료형 심화',
        'Python 3주차 - 기초 문제 풀이 (입출력, 연산)',
        'Python 4주차 - 리스트, 선택문',
        'Python 5주차 - 반복문',
        'Python 6주차 - 응용 문제 풀이 1 (선택문, 반복문)',
        'Python 7주차 - 함수',
        'Python 8주차 - 응용 문제 풀이 2 (함수와 리스트)',
        'Python 9주차 - 튜플, 딕셔너리, 세트',
        'Python 10주차 - 파일 입출력',
        'Python 11주차 - 심화 문제 풀이 1',
        'Python 12주차 - 심화 문제 풀이 2'
    ]
};

export const dataCourse = {
    title: '데이터 분석 늪에서 살아남기',
    topics: [
        '추후 업데이트 예정입니다.'
    ]
};

export const mlCourse = {
    title: '머신러닝 산에서 살아남기',
    topics: [
        '추후 업데이트 예정입니다.'
    ]
};

export const cCourse = {
    title: 'C언어 바다에서 살아남기 ①',
    topics: [
        'C언어 기초 1주차 - Hello World 톺아보기, 자료형과 변수',
        'C언어 기초 2주차 - printf, scanf, 연산자',
        'C언어 기초 3주차 - 기초 문제 풀이 (입출력, 연산)',
        'C언어 기초 4주차 - 조건문',
        'C언어 기초 5주차 - 반복문',
        'C언어 기초 6주차 - 응용 문제 풀이 1 (조건문, 반복문)',
        'C언어 기초 7주차 - 배열과 문자열',
        'C언어 기초 8주차 - 함수, 전역 변수와 지역 변수',
        'C언어 기초 9주차 - 응용 문제 풀이 2 (배열과 함수)',
        'C언어 기초 10주차 - 함수와 포인터',
        'C언어 11주차 - 심화 문제 풀이 1',
        'C언어 12주차 - 심화 문제 풀이 2'
    ]
};

export const cCourse2 = {
    title: 'C언어 바다에서 살아남기 ②',
    topics: [
        'C언어 심화 1주차 - 함수 정복하기, 재귀함수',
        'C언어 심화 2주차 - 고난이도 문제 풀이 1 (제어문과 함수)',
        'C언어 심화 3주차 - 포인터 정복하기',
        'C언어 심화 4주차 - 배열과 주소, 다차원 배열',
        'C언어 심화 5주차 - 고난이도 문제 풀이 2 (배열과 포인터)',
        'C언어 심화 6주차 - 정렬 알고리즘',
        'C언어 심화 7주차 - 고난이도 문제 풀이 3 (정렬 알고리즘)',
        'C언어 심화 8주차 - 문자열과 문자열 처리 함수',
        'C언어 심화 9주차 - 고난이도 문제 풀이 4 (문자열 정복하기)',
        'C언어 심화 10주차 - 구조체',
        'C언어 심화 11주차 - 고난이도 문제 풀이 5 (구조체)',
        'C언어 심화 12주차 - 파일 입출력'
    ]
};

export const javaCourse = {
    title: '자바 정글에서 살아남기',
    topics: [
        '추후 업데이트 예정입니다.'
    ]
};

export const htmlCourse = {
    title: 'HTML 동굴에서 살아남기',
    topics: [
        '추후 업데이트 예정입니다.'
    ]
};
